# Copy Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..Copy Method
StructuralAsset Class See Also
---
Produces a copy of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public StructuralAsset Copy()
```

Visual Basic
---
```text
Public Function Copy As StructuralAsset
```

Visual C++
---
```text
public:
StructuralAsset^ Copy()
```

# ### Return Value
A copy of the asset.
# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace